БухЭксп/InformationRegisters/CW_ОбъектыНаСогласовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбъектыНаСогласовании</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокСогласованияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыСогласования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ЭтапыСогласования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОбъектыНаСогласовании/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьОбъектНаСогласование(ОбъектСогласования, мДанныеДляЗаписи = Неопределено) Экспорт
	
	Набор = РегистрыСведений.CW_ОбъектыНаСогласовании.СоздатьНаборЗаписей();
	Набор.Отбор.ОбъектСогласования.Установить(ОбъектСогласования);
	Набор.Прочитать();
	Набор.Очистить();
	
	Если мДанныеДляЗаписи <> Неопределено Тогда
		Для Каждого ЭлементМассива из мДанныеДляЗаписи Цикл
			ЗаписьНабора = Набор.Добавить();
			ЗаписьНабора.ОбъектСогласования 		= ОбъектСогласования;
			
			ЗаписьНабора.ГруппаСогласования 		= ЭлементМассива.ГруппаСогласования;
			ЗаписьНабора.Пользователь 				= ЭлементМассива.Пользователь;
			ЗаписьНабора.ЭтапСогласования 			= ЭлементМассива.ЭтапСогласования;
			
			ЗаписьНабора.ВидОбъекта 				= ПолучитьВидОбъекта(ОбъектСогласования);
			ЗаписьНабора.ДатаНачала 				= ЭлементМассива.ДатаНачала;
			ЗаписьНабора.ДатаПланЗавершения 		= ЭлементМассива.ДатаПланЗавершения;
			ЗаписьНабора.ПорядокСогласования 		= ЭлементМассива.ПорядокСогласования;
			ЗаписьНабора.Комментарий 				= ЭлементМассива.Комментарий;
			
		КонецЦикла;
	КонецЕсли;
	
	Набор.Отбор.ОбъектСогласования.Установить(ОбъектСогласования);
	Набор.Записать();
	
КонецПроцедуры

Функция ПолучитьВидОбъекта(ОбъектСогласования)
	
	Возврат ОбъектСогласования.Метаданные().Синоним;
	
КонецФункции

Процедура ОчиститьДанныеРегистра(ОбъектСогласования) Экспорт
	
	Набор = РегистрыСведений.CW_ОбъектыНаСогласовании.СоздатьНаборЗаписей();
	Набор.Отбор.ОбъектСогласования.Установить(ОбъектСогласования);
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать();
	
КонецПроцедуры

#КонецЕсли
